# RebarSystemHookOrientTopDirn2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemHookOrientTopDirn2 Property
ParameterTypeId Class See Also
---
"Top Minor Hook Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemHookOrientTopDirn2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemHookOrientTopDirn2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemHookOrientTopDirn2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace